Repository: mozilla-l10n/mt-training-data
Catalog: azz/azz_pontoon.tmx
Source language: en_us
Languages: azz

source: Firefox Help
azz: Nepaleuilis tein kipia Firefox

source: Firefox is a browser with a conscience. As part of the technology non-profit Mozilla, we fight for your online rights, keep corporate powers in check and help educate developing countries on healthy Internet practices. So when you choose Firefox, we’re choosing you, too.
azz: Firefox se navegador tein kipia itanemilil. Tejuan pouij iteposuan Mozilla tein amo kitemoua motomintis, timochikauaj momelaujkatanauatiluan itech Internet, tiktsinkixtiaj ichikaujkauelilis uejueyitekitiloyamej uan no tikinmachtiaj ueyialtepemej kampa kipanouaj tatasojtilis kemej kitatekiujtiskej Internet tein paktok. Yejua ika, komo tikonixpejpenas Firefox, no timitsonixpejpenaskej.

source: Firefox is built by a non-profit. That means we can do things that others can’t, like build new products and features without a hidden agenda. We champion your right to privacy with tools like Private Browsing with Tracking Protection, which go beyond what Google Chrome and Microsoft Edge offer.
azz: Firefox amo kichijchiujkej porin kinekkej motomintiskej. Nejin kiijtosneki ke uelis tikchiuaskej tensa tein oksekin amo, kemej tikchijchiuaskej yankuikej takilmej uan nepaleuilmej ta amo tikpiaj se toichtakatanejnekilis. Tikpaleuiaj ininmelaujkatanauatiluan nochimej maj kinyekpialikan tein ininaxkan ika manamikmej kemej se uelis kitatekiujtis Internet uan amo se mokuejmolos porin youalitonal tikyekpiaj maj amo tetoktilikan, uan nejin amo kintemaktilijtokej Google Chrome nion Microsoft Edge.

source: Firefox is independent and a part of the non-profit Mozilla, which fights for your online rights, keeps corporate powers in check and makes the Internet accessible to everyone, everywhere.
azz: Firefox amo kitamakati akin okachi uejueyichiuanimej uan poui Mozilla tein amo kitemoua motomintis, mochikaua maj nochin tokniuan kipia ininmelaujkatanauatiluan itech Internet, kitsinkixtia ichikaujkauelilis uejueyitekitiloyamej uan no kichiua nochimej uelis kalakiskej Internet, kampa yeski.

source: Firefox is non-profit, non-corporate, non-compromised. Choosing Firefox isn’t just choosing a browser. It’s a vote for personal freedom.
azz: Firefox amo kitemoua motomintis, amo poui uan amo kipia netenkauialis ika semej tekitiloyamej, Komo tikonixpejpenas Firefox, amo sayoj se taixpejpenalis, ta se taixtalilis tein kipaleuia maj taltikpakneminij yeskij tatojtomalmej.

source: Firefox is now faster and leaner
azz: Axkan Firefox okachi ijsiuik uan ejkaujtik

source: Firefox: More protection. Less worry.
azz: Firefox: Okachi tematampauilis. Amo okachi kuejmololis.

source: Firefox Nightly automatically sends feedback to Mozilla.
azz: Firefox Nightly iselti san kipanoltilia Mozilla tanemililmej.

source: Firefox on Facebook
azz: Firefox itech Facebook

source: Firefox on Twitter
azz: Firefox itech Twitter

source: Firefox Password Manager saves all your passwords in one place so you can automatically login to sites, or retrieve saved passwords.
azz: Inepaleuil Firefox tein itokay Password Manager kieua nochin moichtakatajkuiloluan sayoj sekosaj uan ijkon tionuelis ijsiujka tionkalakteuas itech sitios oso tikonajsis ichtakatajkuilolmej tein achto tikoneuak.

source: Firefox Private Browsing blocks ads with trackers.
azz: Nepaleuil maj se kitatekiujti Internet uan amo se mokuejmolo tein kipia Firefox kiajchiua tanauatilmej tein tetoktiliaj.

source: Firefox protects your online privacy and blocks trackers that follow you around the web.
azz: Firefox kuali mitsonyekpilia tein tikonseliltis Internetkopa uan amo kikaua maj tekitikan tein mitsontoktiliaj itech web.

source: Firefox: Rebel with a cause
azz: Taixnamikkej tein kipia keyej

source: Firefox Test Pilot
azz: Taejekolis piloto ika Firefox

source: Fly with that bookmark
azz: Xionpatani ika nejin neskayot marcador

source: Focus Browser
azz: Navegador tein Focus

source: Following the pack isn’t our style. As part of the non-profit Mozilla, Firefox leads the fight to protect your online rights and champion an Internet that benefits everyone — not just a few.
azz: Amo tikintojtokatinemi olochichkamej. Firefox poui Mozilla tein amo kitemoua motomintis, uan ijkon kiixyekana tateuilis tein kitemoua kimatampauia takachiualis itech Internet tein kipiaj tokniuan uan kipaleuia Internet maj nochimej kinpaleui — amo se ome eyi taltikpakneminij san.

source: Follow us on:
azz: Xitechontojtoka itech:

source: Forget the reset. Firefox Password Manager keeps all your passwords so you can log in automatically, or find saved passwords easily. For super security, give your computer a <a href="%(url)s">master password</a>.
azz: Xikonelkaua oksepa tiontapeualtis. Inepaleuil Firefox Password Manager kiyekpia nochin moichatakatajkuiloluan uan ijkon tionuelis ijsiujka tionkalakteuas oso amo ouij tikonajsis ichtakatajkuilolmej tein achto tikoneuak. Xikonmaka mocomputadora se <a href="%(url)s">ichtakatajkuilol tein kampa yeski kualtia</a> uan tikonpias se uejueyi yekyetolis.

source: Forget the reset. Save passwords and logins quickly.
azz: Xikonelkaua oksepa tiontapeualtis. Ijsiujka xikoneua ichtakatajkuilolmej uan kampa se kalakteua.

source: Format
azz: Formato

source: Forums
azz: Nechikolmej foros

source: Free Upgrade
azz: Tayankuililis tein amo moneki tikonixtauas

source: Free Web Browser
azz: Navegador tein amo se moneki kiixtauas

source: Futz with that bookmark
azz: Amo xiontonalpoloua ika nejin neskayot marcador

source: Gaming on the Web
azz: Auilmej itech Web

source: Get all the tabs without lags
azz: Xikonijsiujkaajsi nochin pestañas

source: Get answers to your questions about Firefox and all Mozilla products from our support team.
azz: Tonechikol akin tepaleuiaj mitsonnankiliskej tajtanilmej tein tikonpias ika Firefox uan ika nochi takilmej tein pouij Mozilla.

source: Get a sneak peek at our next generation web browser, and help us make it the best browser it can be: try Firefox Nightly.
azz: Xikonita tonavegador web tein yankuik, uan xitechonpaleui maj tikchijchiuakan okachi kuali navegador tein moajsis: xikonixejeko Firefox Nightly.

source: Get better privacy
azz: Xikonajsi tein okachi kuali ika keniuj kiyekpiaj tein teaxka itech Internet

source: Get Firefox for privacy
azz: Xikonajsi Firefox ta kiyekpia tein kiselia

source: Get Firefox news
azz: Maj se kiselis tanauatilmej tein mouikaj Firefox

source: Get Firefox tips, tricks, news and more
azz: Xikonajsi tayojmajxitilis, taixpetanilis, tanauatilmej uan okachiok tein mouika iuan Firefox

source: Get Firefox today
azz: Axkan xikonajsi Firefox

source: Get involved
azz: Xioniniuanti

source: Get Involved
azz: Xioniniuanti

source: Get more done. Browse faster and lighter with multiple tabs
azz: Okachi xikonchiua tensa. Okachi ijsiujka xikontatekiujti Internet ika tataman pestañas, kemej yeskia okachi ejkaujtik

source: Get more done with Firefox
azz: Okachi taman xikonchiua ika Firefox

source: Get Mozilla updates
azz: Maj se kiselis tayankuililismej tein Mozilla

source: Get powerful add-ons
azz: Xikonajsi chikaujkej tamajsikayomej

source: Get started with Sync
azz: Xionpeua ika Sync

source: Get the latest &amp; greatest from Firefox delivered straight to your inbox.
azz: Xikonajsi tein yankuik uan okachi kuali tein kipia Firefox uan mitsontatitaniliskej kampa kalakij mocorreojuan san.

source: Get your faves all sorted with the bookmark star icon, which lets you add custom names and folders quickly. Then dial in your bookmarks toolbar to make sure you never lose sight of the links you love.
azz: Xionajsi tein tikonteluelita uan tetekpantokej ika ixtakopin icono tein sitalin, nejin mitsonkauas tikontalis tokaymej uan carpetas uan ijsiujka tikonchiuas kemej tikonnekis. Ijkon, xikonpatskili mobarraj ika manamik tein neskayomej marcadores, uan nochipa tikonitstok tapatskililismej tein mitsonpaktiaj.

source: Get your tabs, logins and history on the go.
azz: Ijsiujka xikonajsi mopestañajuan, kampa se kalakteua uan historial.

source: Give up the memory game with Firefox Password Manager.
azz: Amo xikonteltekitilti motaelnamikilis ika inepaleuil Firefox Password Manager.

source: Go beyond the default
azz: Amo xionmokaua sayoj keniuj yekinika kiyektalijkej motepos san

source: Governance
azz: Keniuj taixyekanaj

source: Help build the last independent browser. Write code, fix bugs, make add-ons, and more.
azz: Xikonpaleui maj mochijchiua navegador tein okachi yankuik uan tein amo akin kiixyekana. Xikonijkuilo código, xikonyektali nepololmej, xikonchijchiua tamajsikayomej uan oksekiok.

source: Help determine what features will go into the next Firefox for Android.
azz: Xitechonpaleui tikixtalijkej toni inepaleuiluan kipias yankuik Firefox ika Android.

source: Help launch new features
azz: Xikonpaelui maj kisakan yankuikej nepaleuilmej

source: Here’s how Firefox protects your privacy
azz: Ijkon Firefox kiyekpia tein kiselia

source: History
azz: Historial tein kinextia nochi tikonitstinemik

source: Hi. We’re Mozilla, the proudly non-profit champions of the Internet, helping to keep it healthy, open and accessible to all.
azz: Ken tietok. Tejuan tiMozilla, titataninij itech Internet akin tikueyipoujtinemij amo tiktemoskej timotomintiskej, akin timochikauaj maj Internet pakkayoyeto, tatapotok uan nochin tokniuan uelis kitatekiujtiskej.

source: Hungry for more?
azz: ¿Okachiok tikonnejneki?

source: If you followed a link, it’s probably broken.
azz: komo tikonajsik kampa tikonpatskilis, xa amo kuali tekiti.

source: If you haven’t previously confirmed a subscription to a Mozilla-related newsletter you may have to do so. Please check your inbox or your spam filter for an email from us.
azz: Komo achto amo tikonyekmatiltij tionmoijkuiloj uan ijkon tikonselis se amaix tein mouika iuan Mozilla, xa monekis kichiuas. Ika kualtakayot, xikonyekita kampa kalakij correos oso tatsetseloloni spam tein tikontalij xa moajsis se correo tein timitsontitanilijkej.

source: If you’re not sure what you’re looking for, start at <a href="%(url)s">mozilla.org</a>.
azz: Komo amo tikonyekmati toni tikontemoua, xikonpeualti <a href="%(url)s">mozilla.org</a>.

source: If your web browser uses too much memory, switch to Firefox.
azz: Komo monavegador kikui tel miak taelnamikilis, xikonpata uan xikontatekiujti Firefox.

source: If you typed in the address, check your spelling. Could just be a typo.
azz: Komo tikonijkuiloj kani tinemi, xikonita keniuj tikonchiuak, xa sayoj se nepolol ika tajkuilmej san.

source: If you’ve found an issue with one of our websites, we’d appreciate it if you could report the problem in Bugzilla, our <a href="%(bugzilla)s">bug tracker</a>. One of our developers will take a look at it as soon as possible.
azz: Komo tikonajsik se taman itech se tositio web, nimitsontasojkamatiliskej maj titechonixpantili ika Bugzilla, <a href="%(bugzilla)s">tein ika tiktojtokatinemij nepololmej</a>. Semej towebchijchiujkauan niman kiitas.

source: I’m okay with Mozilla handling my info as explained in <a href="%s">this Privacy Notice</a>
azz: Kuali nikita maj Mozilla kitatekiujti tein nikmatiltis ijkon kemej motanauatia itech <a href="%s">nejin Tanemililis keniuj tikyekpiaj tein tikseliaj</a>

source: Independence
azz: Ijkuak se moixyekana

source: (in English)
azz: (ingléskopa)

source: Inspect and refine code to build pixel-perfect layouts.
azz: Xikonita ox yektachijchiujkej uan xikonyektali código uan ijkón tionuelis tikchiua tachijchiualis tein amo kipia nepolol.

source: Inspector
azz: Manamik tein kiita ox yektachijchiujkej

source: Interest Dashboard
azz: Uapal tein ika se kiyoltilana

source: Internet for people, <br>not profit.
azz: Internet maj kitatekiujtikan tokniuan, <br>amo tein ika oksekin kitemoskej motomintiskej

source: Internet for people, not profit
azz: Internet maj kitatekiujtikan tokniuan, amo tein ika oksekin kitemoskej motomintiskej

source: Internet Health
azz: Keniuj Pakkayoyetok Internet

source: iOS Browser
azz: Navegador tein iOS

source: Is your computer slow? Your browser might be using too much memory. Switch to Firefox today for more speed.
azz: ¿Motepos amo ijsiujkatekiti? Xa monavegador kikuitinemi tel miak taelnamikilis. Xionmopata axkan uan xikontatekiujti Firefox tein okachi ijsiuik.

source: It looks like you’re running an older version of Firefox.
azz: Moita ke tikontatekiujtijtok se versión Firefox tein amo yankuik.

source: January
azz: Metsti enero

source: Join the conversation
azz: Xioniniuanti itech tanojnotsalis

source: July
azz: Metsti julio

source: June
azz: Metsti junio

source: Keep up with<br> all things Firefox.
azz: Xikonsentoka ika<br> nochi taman tein kipia Firefox.

source: Language
azz: Tajtolis

source: Leadership
azz: Taixyekanalis

source: Learn about the benefits of working at Mozilla and view open positions around the world.
azz: Xikonixmati toni tatiochualis tikonpias komo tiontekitilis Mozilla, uan xikonita tein tekimej axkan onkakej nochi semanauak taltikpak.

source: Learn more
azz: Okachi xionmomachti

source: Learn More
azz: Okachi xionmomachti

source: Learn more about Firefox Accounts
azz: Kampa se okachi uelis momachtis cuentas tein kipia Firefox

source: Learn more about Test Pilot
azz: Kampa se okachi uelis momachtis Test Pilot

source: Legal
azz: Tein uelis momelauas iixpan tekiuanij

source: Legal Notices
azz: Tanauatil tein uelis momelauas iixpan tekiuanij

source: Less memory usage than Chrome
azz: Amo okachi kikui taelnamikilis uan amo Chrome

source: Level-up browser gameplay
azz: Keniuj navegador kitekitiltia auilmej

source: Lightbeam for Firefox
azz: Lightbeam ika Firefox

source: Limited data collection
azz: Nechikolis ika datos tein kiixtalijkej

source: Make Firefox yours
azz: Xikonchiua Firefox moaxka

source: March
azz: Metsti marzo

source: May
azz: Metsti mayo

source: Memory
azz: Taelnamikilis

source: Menu
azz: Menú

source: Mission
azz: Totekiuj

source: Mobile
azz: Tein se uelis kiuikas

source: Mobile Browser for Android
azz: Navegador tein tekiti itech tepos tein se uelis kiuikas kampa yeski, ika Android

source: Mobile Browser for iOS
azz: Navegador tein tekiti itech tepos tein se uelis kiuikas kampa yeski, ika iOS

source: Modern
azz: Axkan motekitiltia

source: Monitor network requests that can slow or block your site.
azz: Xikonita tajtanilis tein red tein uelis kichiuas mositioj maj tiuistia oso amo kikaujtokej maj tekiti.

source: Monthly
azz: Mejmetstika

source: More freedom
azz: Tionmomachilis okachi titatojtomal

source: More performance
azz: Okachi kuali kichiua tensa

source: More powerful Private Browsing
azz: Nepaleuil maj se kitatekiujti Internet uan amo se mokuejmolo yejua okachi chikauak

source: More privacy
azz: Okachi kuali kiyekpiaj tein kiseliaj

source: More private
azz: Okachiok amo senteixtenoj

source: More protection than Incognito mode or InPrivate.
azz: Okachi tapaleuilis ok uan amo tein kimakatinemij nepaleuilmej maj amo moita se itokay oso InPrivate.

source: Mozilla Firefox Web Browser
azz: Navegador tein web Mozilla Firefox

source: Mozilla on Facebook
azz: Mozilla itech Facebook

source: Mozilla on Twitter
azz: Mozilla itech Twitter

source: MPEG-4 format
azz: Formato MPEG-4

source: Multi-tasking with multiple tabs just got easier. Firefox is now a multi-process browser, which means that your tabs stay fresh and won’t take forever to reload. With 86% less hang time, switch quickly between tabs even as you open more.
azz: Se kichiuas miak tekimej tein kiiliaj multitarea ika tataman pestañas axkan okachi amo ouij. Firefox axkan se navegador tein uelis kipias tataman ojtokaltilismej, tein kiijtosneki ke ipestañajuan nochipa moyankuilijtiyaskej uan oksepa moijsiujkaixnextiskej. Kemej horas tein se mochixtok yejua 86% amo okachi ke inintechkopa oksekin, ika Firefox xionmopata se pestaña uan okse, uan no ijkuan okachiok tikontapouas.

source: Navigation
azz: Se kitatekiujtis Internet

source: Need help?
azz: ¿Xa moneki timitsonpaleuiskej?

source: Need help installing?
azz: ¿Moneki timitsonpaleuis maj tiontatali?

source: Network
azz: Matat

source: News
azz: Tanauatilmej

source: Next
azz: Okse

source: Nightly Blog
azz: Tepostanojnots blog tein poui Nightly

source: No more “try again” while you’re trying to get somewhere. Log in to your Firefox Account on your phone, and your passwords come with you. Your login details will simply appear, just like that.
azz: Amo sepa ok "oksepa xikonchikua" ijkuak tikontemojtok tikonajsis se sitio. Xionkalakteua itech mocuenta Firerfox ika moteléfono uan moichtakatajkuiloluan yaskej mouan. Tein moneki tionkalakteua ipa monextis, kemej nejin.

source: No one likes a computer hog! Firefox is a lean, mean (actually we’re pretty nice) browsing machine. Since we use less RAM than Chrome, your other programs can keep running at top speed.
azz: ¡Se tepos tein tel amo kuali amo akin kiuelita! Firefox se navegador tein ejkaujtik, tein tajtakoyampa (tein melauj, yejua semi kuali). Kemej kikui amo okachi taelnamikilis RAM tein kikuitinemi Chrome, oksekin programas uelis telijsiujkatekitiskej.

source: No strings attached
azz: Amo ilpitok

source: Not only do trackers collect info, they can weigh down your browsing speeds. Only Firefox Private Browsing blocks ads with hidden trackers, so you can drop the baggage and browse freely.
azz: Amo sayoj tein tetoktiliaj kinechikouaj tein teaxka, ta uelis kiijtakoskej ijsiujkayot ijkuak tekititok Internet. Sayoj Firefox Private Browsing san kiajchiuilia tanauatilmej tein kipia tein teichtakatoktiliaj, uan ijkon tionuelis tikonkauas nejin tamamal uan titatojtomal tikontatekiujtis Internet.

source: November
azz: Metsti noviembre

source: Now get on the go.
azz: Axkan tiyouej.

source: October
azz: Metsti octubre

source: Ogg Theora format
azz: Formato Ogg Theora

source: One-time
azz: Sepa san

source: Open source
azz: Tein se uelis mokuis tein amo tatsaktok

source: Opted-in to privacy, so you can browse freely.
azz: Tikixpejpenaj kiyekpiaskej tein kiseliskej, ijkon tionuelis tikontatekiujtis tatojtomal Internet.

source: Other languages:
azz: Oksekin tajtolismej:

source: Other Systems and Languages
azz: Oksekin sistemas uan tajtolismej

source: Our impact
azz: Tonexokolilis

source: Our innovations
azz: Tein tikchijchiujkej tein yankuik

source: Our most customizable Firefox for Android yet.
azz: ToFirefox ika Android tein okachiok tionuelis tikonyekchiuas kemej tikonkuisnekis

source: Our new, powerful multi-process platform handles all your tabs without slowing down your computer.
azz: Yankuik uan chikauak plataforma tein toaxka uan tein kipia tataman ojtokaltilismej tekiti ika nochin ipestañajuan uan amo kichiua maj motepos maj yolikat yeski.

source: Our Products
azz: Totakiluan

source: Page language:
azz: Tajtolis itech nejin página:

source: Password hero
azz: Chiujkej ika ichtakatajkuilol

source: Password Manager
azz: Kampa se uelis kiyekanas ichtakatajkuilolmej

source: Password Manager achievement unlocked
azz: Tionmomachtijya nochi tein monekia tein mouika ika manamik tein ika se kiixyekanas ichtakatajkuilolmej

source: Password master
azz: Ichtakatajkuilol tein kampa yeski kualtia

source: Password ninja
azz: Ichtakatajkuilol tein ninja

source: Patents
azz: Patentes

source: Performance
azz: Keniuj taki se itachiualis

source: Personal
azz: Tein sayoj tejuatsin tikontatekiujtis

source: Personalize Firefox with everything from themes to privacy tools.
azz: Xikonyekchiua nochi Firefox kemej tikonkuisnekis, kemej neskayot tamachtilismej oso manamikmej tein ika tikonyekanas motajkuilolneskayouan.

source: Please choose a download to continue.
azz: Ika kualtakayot xikonixpejpena tein tikontemouij uan tionuelis tiksentokas.

source: Please follow <a href="%(url)s">these instructions</a> to install Firefox.
azz: Xikonchiua <a href="%(url)s">nejin tanauatilmej</a> uan ijkon tikontalilis Fiefox motepos.

source: Please turn on JavaScript to display this page correctly.
azz: Xikontekitilti JavaScript uan ijkon tionuelis kuali tikonitas nejin página.

source: Portions of this content are ©1998–%(current_year)s by individual mozilla.org contributors. Content available under a <a href="%(url)s">Creative Commons license</a>.
azz: Sekin taman tein nikan moajsij teaxkauan uan kimatampauiaj tein ika kiiliaj derechos de autor ©1998–%(current_year)s uan ininaxkauan sekin tokniuan akin kipaleuiaj itech mozilla.org. Oksekin taman tein nikan moajsij se uelis kikuis ika se licencia <a href="%(url)s">Creative Commons</a>.

source: Portions of this content are ©1998–%(current_year)s by individual mozilla.org contributors. Content available under a <a rel="license" href="%(url)s">Creative Commons license</a>.
azz: Sekin taman tein nikan moajsij teaxkauan uan kimatampauiaj tein ika kiiliaj derechos de autor ©1998–%(current_year)s uan ininaxkauan sekin tokniuan akin kipaleuiaj itech mozilla.org. Oksekin taman tein nikan moajsij se uelis kikuis ika se licencia <a rel="license" href="%(url)s">Creative Commons</a>.

source: Powerful JavaScript debugger with support for your framework.
azz: Chikauak tachipaualoni ika JavaScript tein uelis kitetsontis moframework.

source: Practice your exactitude with every bookmark manager <a href="%(url)s">add-on</a> you can think of, from full page snapshots to quick-switch sidebars to locked-down-tight private bookmarks.
azz: Xikonita sayoj tein tikonyolnejnektinemi san ika sejsemej <a href="%(url)s">tamajsikayomej</a> kampa se uelis kiyekanas neskayomej marcadores, tel miak onkakej kanachi tionuelis tikonixnemilis: kampa tikonitas páginas tein ajsitokej, barras tein tanakastan oso neskayomej marcadores tein amo senteixtenoj uan kiajchiuilijkej.

source: Pre-release downloads
azz: Tein se uelis kitatemouis achtopa kitematiltiskej

source: Press Center
azz: Amatanauatilmej

source: Previous
azz: Achto

source: Privacy
azz: Keniuj tiyekpiaj tein tikseliaj

source: Privacy Policy
azz: Tanemililis keniuj tikyekpiaj tein tikseliaj

source: Private Browser with extra tracking protection
azz: Navegador tein kuali kiyekpia tein kiselia uan no kiyekpia maj amo tetoktilikan

source: Private Browsing
azz: Maj se kitatekiujti Internet uan maj amo se mokuejmolo

source: Products
azz: Takilmej

source: Protecting the health of the internet.
azz: Maj se kipaleui Internet tein paktok.

source: Protect your privacy and browse faster with Firefox features
azz: Xikonpaleui maj mitsonyekpialikan tein Internetkopa kiseliskej uan xikontatekiujti Internet okachi ijsiujka ika nepaleuilmej tein kipia Firefox.

source: Protect your rights
azz: Xikonmatampaui momelaujkatanauatiluan

source: Proudly non-profit. <br>Donate before Dec 31.
azz: Semi techyolpaktia maj amo tiktemokan timotomintiskej. <br>Xitechonpaleui ika tomin achto 31 metsti diciembre.

source: Quickly save and organize your favorite sites.
azz: Ijsiujka xikoneua uan xikontali sitios tein tikonteluelita.

source: Read all about it in our <span>newsletter</span>
azz: ¡Xikonixtajtolti nochi tanauatilmej ika Firefox itech <span>toamaixtsin!</span>

source: Read Mozilla’s mission
azz: Xikonixtajtolti itekiuj Mozilla

source: Read our Internet Health Report
azz: Xikonixtajtolti toamaix tein kitematiltia Keniuj Pakkayoyetok Internet

source: Read our privacy policy
azz: Xikonixtajtolti totanemililis keniuj tikyekpiaj tein tikseliaj

source: Refresh Firefox
azz: Xikonyankuili Firefox

source: Release Notes
azz: Tajtolmelaualismej

source: Replay the video
azz: Oksepa xikonita video

source: Report Trademark Abuse
azz: Maj se techixpantili amo kuali kikuitokej neskayot tanamakalis

source: Responsive Design Mode
azz: Keman se uelis kichijchiuas tensa tein se uelis kipatas

source: Return to top
azz: Maj ajko mokuepa

source: Scratchpad
azz: Tajkuilolamaix ika tajtolmelaualis

source: Secure
azz: Maj xionyekyeto
